In [128]:
import numpy as np
import pandas as pd

In [129]:
dict1={
    "name":['Harry', 'Rohan', 'Skillf', 'Shubh'],
    "marks":[92,34, 24, 17],
    "city":['Rampur','Kolkata', 'Bareilly', 'Antartica']
}

In [130]:
df=pd.DataFrame(dict1)

In [131]:
df

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [132]:
#to see the top most data
df.head(2)

    name  marks     city
0  Harry     92   Rampur
1  Rohan     34  Kolkata

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [134]:
#the numerical data are shown in details, like marks
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [135]:
#to convert into the csv file
df.to_csv('friends.csv')

In [136]:
#to hide the index
df.to_csv('friends_index_false.csv', index=False)

In [137]:
#to see the last most data
df.tail(1)

    name  marks       city
3  Shubh     17  Antartica

In [138]:
read=pd.read_csv('demo.csv')

In [139]:
read

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [140]:
# to read only the particular row like name, city etc
read['name']

0     Harry
1     Rohan
2    Skillf
3     Shubh
Name: name, dtype: object

In [141]:
# we even can read the data in the particular index like:

read['name'][0]

'Harry'

In [142]:
read['name'][0]='Harry'

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/454520273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['name'][0]='Harry'

In [143]:
# even can change the data,
read['marks'][0]=99
# although it is showing the warning, but the code has been  updated!!

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/2093934311.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read['marks'][0]=99
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_12282/2093934311.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['marks'][0]=99

In [144]:
read

     name  marks       city
0   Harry     99     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [145]:
#to convert in to a csv file
read.to_csv('read1.csv', index=False)

In [146]:
#it also allow to custom index
read.index=['first', 'Second','Third', 'Fourt']

In [147]:
read

          name  marks       city
first    Harry     99     Rampur
Second   Rohan     34    Kolkata
Third   Skillf     24   Bareilly
Fourt    Shubh     17  Antartica